airbit/Airbit_CC3200/boards.txt
##############################################################
lpcc3200.name=LaunchPad w/ cc3200 (80MHz)
lpcc3200.upload.maximum_size=262144
lpcc3200.build.mcu=cortex-m4
lpcc3200.build.f_cpu=80000000L
lpcc3200.build.core=cc3200
lpcc3200.build.variant=launchpad
lpcc3200.ldscript=cc3200.ld
#lpcc3200.upload.maximum_ram_size=32768

##############################################################
witii_cc3200.name=Witii CC3200 (80MHz)
witii_cc3200.upload.maximum_size=262144
witii_cc3200.build.mcu=cortex-m4
witii_cc3200.build.f_cpu=80000000L
witii_cc3200.build.core=witii_cc3200
witii_cc3200.build.variant=witii_cc3200
witii_cc3200.ldscript=cc3200.ld
#witii_cc3200.upload.maximum_ram_size=32768
